Revit 2027 API
TableSectionData.GetCellCalculatedValue(Int32) Method
 Gets the calculated value for the specified column
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableCellCalculatedValueData GetCellCalculatedValue(
	int nCol
)
Public Function GetCellCalculatedValue (
	nCol As Integer
) As TableCellCalculatedValueData
public:
TableCellCalculatedValueData^ GetCellCalculatedValue(
	int nCol
)
member GetCellCalculatedValue :
        nCol : int -> TableCellCalculatedValueData
Parameters
nCol Int32
Return Value
TableCellCalculatedValueData
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
GetCellCalculatedValue Overload
Autodesk.Revit.DB Namespace